# 2) უყურეთ ამ ვიდეოს https://www.youtube.com/watch?v=TLPHmHPaCiQ&t=1122s&ab_channel=Cybernews
# Done
# 3) კომენტარის სახით ჩამოწერეთ და დეტალურად განიხილეთ Control Flow-ს შემადგენელი 3 კომპონენტი.
# Sequencing - დახარისხება
# Selection - არჩევა
# Iteration - ციკლები

# 4) კომენტარის სახით დაწერეთ თუ რას ნიშნავს იტერაცია და რით განსხვავდება for და while ციკლი ერთმანეთისგან. დაწერე ორივე ციკლის თითო მაგალითი.
# for loop და while loop განსხვავდება ერთმანეთისგან იმით, რომ როცა ვიცით რაიმეს რაოდენობა ვირჩევთ და ვიყენებთ for loop-ს დანარჩენ შემთხვევაში while loop
# Itaration არის პროგრამირებაში მოკლედ გამეორებას ნიშნავს

# 5) დაწერეთ პროგრამა, რომელიც 1-დან 10-მდე რიცხვების ჯამს დაითვლის for ციკლით.
sum = 0
for i in range(1, 11): 
    sum += i      
# 6) დაწერეთ მეხუთე დავალების მსგასი პროგრამა, თუმცა ამჯერად While loop-ის გამოყენებით.
i = 0
while i <= 10:
    i += 1
# 7) გამოიყენეთ for ციკლი და დაბეჭდეთ 2-დან 20-ის ჩათვლით ყველა ლუწი რიცხვი.
for i in range(2, 20, 1):
    print(i)
# 8) While ციკლის საშუალებით დაბეჭდეთ ყველა კენტი რიცხვი 30-დან 70-მდე.
# პირველი რიცხვი
number = 30
while number <= 70:
    if number % 2 != 0: 
        print(number)
    number += 1 
# 9) კომენტარის სახით ახსენით თუ როგორ მუშაობს Indexing პითონში და განმარტეთ უშუალოდ Index-ის მნიშვნელობა.
# Indexing მაგალითი:
list1 = [1, 2, 3, 4]
#        0  1  2  3
