# 2) შექმენით 4 ცვლადი და ოთხივეში შემოატანინეთ მომხმარებელს 4 სხვადასხვა ტიპის მნიშნველობა input()'ის მეშვეობით.
# შემდეგ კი გამოიტანეთ ოთხივე ცვლადის ტიპი და დაწერეთ დასკვნა კომენტარის სახით ( რა მოხდა და რატომ მოხდა )
cvladi1 = 11
cvladi2 = "string"
cvladi3 = True
cvladi4 = 11.2
print(type(cvladi1))
print(type(cvladi2))
print(type(cvladi3))
print(type(cvladi4))

# 3) დაწერეთ პროგრამა სადაც შემოიტანთ თქვენი ოჯახის წევრების ასაკებს თქვენი დავალება იქნება რომ დაპრინტოთ რამდენი წლისები იქნებიან 20 წლის შემდეგ.
input1 = int(input("Enter your age:"))
print(input1 + 20)
# 1) გააკეთეთ sololearn Fixing Data Types'ის ჩათვლით
# Done