# 1) გააკეთეთ sololearn Module 5 Quiz'ის ჩათვლით
# Done
# 2) შექმენით 10 ელემენტიანი list'ი და კომენტარის სახით დანომრეთ (მიუწერეთ ინდექსები). შემდეგ კი უბრალოდ გამოიტანეთ ეკრანზე
list1 = ["hi", "hi", "hi", "hi", "hi", "hi", "hi", "hi", "hi", "hi", "hi"]
#         0     1     2     3     4     5     6     7     8      9    10
# 3) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი.
print(list1[0])
print(list1[1])
print(list1[2])
print(list1[8])
print(list1[9])
print(list1[10])
# 4) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი .
# 5) შექმენით 5 სიტყვიანი სტრინგი, შექმენით კიდევ 5 ახალი ცვლადი და ინდექსინგის მეშვეობით თითოეულს მიანიჭეთ პირველი სტრინგიდან სიტყვები
# couldnt do it

# 6) შექმენით for loop'ი თითოეული სიმბოლოს დასაბეჭდად სტრინგში -> "Hello, World!".
string = "Hello, World!"
for x in string:
    print(x)

# 7) შექმენით while loop'ი 1-დან 10-მდე რიცხვების დასაბეჭდად.
i = 1
while i <= 10:
    print(i)
    i += 1
# 8) შექმენით while loop'ი რომელიც დათვლის რიცხვებს 1დან 100მდე თუმცა გამოტოვებს რიცხვებს 50დან 60მდე.
count = 1
while count <= 100:
    if 50 <= count <= 60:
        count += 1
        continue
    print(count)
    count += 1