# 2) ტერმინალში გაშვების გარეშე დაადგინეთ თუ რას გამოიტანს მოცემული კოდი:
# True and False or False or True and False
# ბოლოს კი გაუშვით ეს კოდი და შეამოწმეთ თქვენი ვარაუდი გამართლდა თუ არა.
# True
print(True and False or False or True and False)

# 3) დაწერეთ პროგრამა, რომელიც მომხმარებელს მოსთხოვს რიცხვის შემოტანას.
# თუ შემოტანილი რიცხვი ლუწია და  მეტია ათზე დაბეჭდოს "True".
# სხვა შემთხვევაში, დაბეჭდოს "False".
number = int(input("Number Here: "))
if number % 2 == 0 and number > 10:
    print("True")
else:
    print("False")

# 4) გადახედეთ რესურსებში ჩაგდებულ მასალას for loop-ების შესახებ.
# Done
# 5) თქვენი სიტყვებით ახსენით თუ როგორ მუშაობს for loop.
# For Loop-ის გამოყენება რაიმე კოდის გასამეორებლად, რიცხვების დასაბეჭდად და ასშ. 
# ის განსაკუთრებული მაშინაა როცა ვიცით რამდენჯერ გამეორდება ციკლი
# 6) დაწერეთ for loop, რომელიც დაბეჭდავს რიცხვებს 1-დან 15-ის ჩათვლით.
for i in range(15):
    print(i)

# 7) დაწერეთ for loop, რომელიც 1-დან 10-მდე ყველა რიცხვის ჯამს გამოთვლის.
sum = 0
for number in range(1, 11):
    sum += number
print(sum)
# 8) გადახედეთ გაკვეთილის ჩანაწერს.
# Done