# კითხვებზე პასუხი (კომენტარებით):
# 1) რომლებია mutable მონაცემთა ტიპები?
# List, Set, Int, Float, Dictionary

# 2) რომლებია immutable მონაცემთა ტიპები?
# Tuple (მას მეტი არ მახსოვდა)
# 3) რა ეწოდება lambda ფუნქციას მეორენაირად?
# მას მეორენაირად ანონიმუსური ფუნქცია ეწოდება
# 4) რა განსხვავებაა map'სა და filter'ს შორის?
# Map (მიზანი): რაიმე ცვლადის მნიშვნელობის გარდაქმნა.
# Filter (მიზანი): მიიღოს ელემენტი რომელიც დავალების პირობას აკმაყოფილებს.
# Fun Fact: Filter-ს პასუხად სულ გამოაქვს Boolean-ი
# 5) რა ჰქვია ორი სტრინგის შეერთებას?
# ორი სტრინგის შეერთებას კონკატენაცია ეწოდება

# MAPS
# გამოიყენეთ map ფუნქცია რომ შექმნათ list'ი სადაც იქნება ამ რიცხვების კვადრატები: [1, 2, 3, 4, 5]
nums = [1, 2, 3, 4, 5]
numbers_squared = list((map(lambda x: x ** 2, nums)))
print(numbers_squared)

# დაწერეთ პროგრამა mapის გამოყენებით რომ გადაიყვანოთ ამ list'ში მოცემული celsius'ები fahrenheit'ში: [0, 20, 30, 40] (1 celsius == 33.8 fahrenheit)

# გამოიყენეთ map ფუნქცია რომ გაადიდოთ ყველა სიტყვის პირველი ასო ამ list'ში: ["hello", "world", "python"].


# FILTERS
# გამოიყენეთ filter ფუნქცია რომ ამოწეროთ მხოლოდ ლუწი რიცხვები list'იდან: [1, 2, 3, 4, 5, 6, 7, 8].
list1 = [1, 2, 3, 4, 5, 6, 7, 8]
nums = list(filter(lambda x: x % 2 == 0, list1))
print(nums)

# დაწერეთ პროგრამა filterის გამოყენებით რომ ამოწეროთ ისეთი string'ები რომლებიც შეიცავენ 4 სიმბოლოს ან მასზე მეტს: ["cat", "house", "tree", "car"].
list2 = ["Hello", "hi", "name", "surname"]
# გამოიყენეთ filter ფუნქცია რომ ამოწეროთ სამის ჯერადი რიცხვები: [3, 9, 15, 22, 27, 30].
