# 1) შექმენით პროგრამა, სადაც მომხმარებელს შემოატანინებთ სახელს, გვარს და ასაკს,
# შემოტანილი მნიშვნელობები შეინახეთ ცვლადებში, ცვლადებსა დაარქვით ისეთი სახელები 
# რომელიც შეესაბამება მნიშვნელობებს, აგრეთვე კომენტარებით ახსენით რა არის ფუნქცია
#  + ყველა ხაზი დააკომენტარეთ და ახსენით თითოეულ ხაზზე რას აკეთებთ
your_name = input("Enter Your Name: ") # შემოგვაქ ცვლადი რომელიც ინახავს სახელს.
your_surname = input("Enter Your Surname: ") # შემოგვაქ ცვლადი რომელიც ინახავს გვარს
your_age = int(input("Enter Your Age: ")) # შემოგვაქვს ცვლადი რომელიც ინახავს ასაკს
print(your_name)
print(your_surname)
print(your_age)
# თითოეულ პრინტში ვპრინტავთ მათ
# Py-ში ფუნქცია არის კოდი რომელიც სრულდება მხოლოდ მაშინ როცა გავუშვებთ, ის გამოიყენება კოდის შესაცვლელად რომელიც უკვე აწყობილია.
# 2) მომხმარებელს შემოატანინეთ 2 რიცხვი, გამოიტანეთ ამ რიცხვებს შორის ყველა მათემატიკური ოპერაცია
num1 = int(input("Enter Your First Number: ")) 
num2 = int(input("Enter Your Second Number:"))
print(num1 + num2)
print(num1 // num2)
print(num1 * num2)
print(num1 - num2)
# 3) bonus: შექმენით პროგრამა სადაც მომხმარებელს შემოატანინებთ სახელს და ასაკს,
# შემდეგ შეამოწმეთ ასაკი, თუ ასაკი >= 18 დაუბეჭდეთ რომ მას შეუძლია შევიდეს კლუბში,
# სხვა შემთხვევაში დაუბეჭდეთ რომ არ შეუძლია.
name = input("Enter Your Name: ")
age = int(input("Enter Your Age: "))
if age >= 18:
    print("You Can Go In Club!")
else:
    print("You Cant Go In Club!")