# 1) მომხმარებელს შემოატანინეთ სახელი და გვარი, რასაც შემდეგ გადაუვლით 
# for loop-ით და შემოტანილი სახელისა და გვარის თითოეულ ასოს ცალ-ცალკე გამოიტანთ ტერმინალში;
inp_1 = input("Enter Your Name: ")
for x in inp_1:
    print(x)
# 2) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ ამ რიცხვის თითოეული ციფრი;
inp_2 = input("Enter Your Number: ")
for x in inp_2:
    print(x)
# 3) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ რიცხვები მომხმარებლის 
# შემოტანილი რიცხვიდან 0-მდე. (მაგ. input = 3. output: 3 2 1 );
inp_3 = int(input("Enter Your Number: "))
for x in range(inp_3, -1, -1): 
    print(x)
# 4) კომენტარის სახით ახსენით თუ როგორ მუშაობს for loop-ი;
# for-ით იწყება ფუნქცია, შემდე ვაკეთებთ საინდენტაციო ცვლადს და in-ს, შემდეგ გავაკეთებთ range()
# და ჩავწერთ თუ რამდენი რიცხვი იქნება და რამდენს გამოტოვებს შემდეგ ორწერტილი და
# ვწერთ print(აქ იწერება საინდენტაციო ცვლადი)

# 5) კომენტარის სახით განმარტეთ თუ რას ნიშნავს საიტერაციო ცვლადი.
for x in range(5): # x არის საინდენტაციო ცვლადი რომელიც ყოველი for loop-ის გადავლაზე ახალ მნიშვნელობას იღებს
    print(x) # შემდეგ ვბეჭდავთ x-ს