# # 1) კომენტარის სახით ახსენით, თუ რა დანიშნულება აქვს სიებს (lists) პითონში, 
# დეტალურად განიხილეთ list-ების სინტაქსი და ახსენით თუ როგორ მუშაობს ინდექსინგი.
list1 = [1, 2, 3, 4, 5] # Indexing იწყება 0-იდან
#        0  1  2  3  4
# List-ებში ნებისმიერი სახის data type შეგვიძლია ჩავსვათ
# # 2) შექმენით სია, სადაც შეინახავთ ჯანსაღ საკვებ პროდუქტებს. 
# შემდეგ კი ტერმინალში დაბეჭდეთ ეს სია.
list2 = ["cucumber", "steak", "egg"]
print(list2)
# # 3) შექმენით სია, სადაც შეინახავთ თქვენი საყვარელი მანქანის მოდელებს. 
# დაბეჭდეთ ამ სიის მესამე ელემენტი.
cars = ["Honda", "Bmw", "Porsche"]
print(cars[2])
# # 4) შექმენით რიცხვების სია და შეინახეთ 10+ ელემენტი. შემდეგ დაბეჭდეთ
#  ამ სიის ბოლო ელემენტი უარყოფითი ინდექსინგის გამოყენებით.
list3 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
print(list3[-3])
# # 5) შექმენით სია და მასში შეინახეთ 5 ფილმის სახელწოდება. დაბეჭდეთ ამ სიის მეორე 
# და მეოთხე ინდექსზე მდგომი ელემენტები. (sclicing-ის გამოყენების გარეშე).
list4 = ["Maze runner", "Dexter", "Breaking bad", "Cobra kai", "Sheldon Childhood"]
print(list4[1])
print(list4[3])
# # 6) ვისაც წინა საშინაო დავალება არ გაგიკეთებიათ, დაფიქრდით და აუცილებლად გააკეთეთ:
# # მომხმარებელს შემოატანინეთ რიცხვი და დაწერეთ პროგრამა, რომელიც შეამოწმებს ეს რიცხვი 
# მარტივია თუ არა. (მარტივია რიცხვი, თუ მას მხოლოდ ორი გამყოფი აქვს).
# #  მინიშნება: გამოიყენეთ For loop და % გამყოფი ოპერატორი, ასევე აუცილებლად 
# დაგჭირდებათ პროგრამაში Boolean ნიშვნელობების გამოყენება (True და False).
# Done

# # 7) გაიარეთ Sololearn - More on conditional statements-ებიდან lists ჩათვლით
# Check ScreenShot